Repository: Kun686/iTerm2-CN
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# ui.swift.ssh.sshfilepanel.create.4759498a
source: Create
zh_hans: 创建

# ui.swift.ssh.sshfilepanel.enter_filename.f06a0eee
source: Enter filename
zh_hans: 输入文件名

# ui.swift.ssh.sshfilepanel.forward.f1c65e14
source: Forward
zh_hans: 前进

# ui.swift.ssh.sshfilepanel.go_to_folder.f5ea0150
source: Go to Folder…
zh_hans: 前往文件夹…

# ui.swift.ssh.sshfilepanel.go_to_home.746c8138
source: Go to Home
zh_hans: 前往个人文件夹

# ui.swift.ssh.sshfilepanel.go_up.40adf160
source: Go Up
zh_hans: 向上一级

# ui.swift.ssh.sshfilepanel.name_of_new_folder_inside_0.5894a7db
source: Name of new folder inside “%1$@”:
zh_hans: “%1$@”内新文件夹的名称：

# ui.swift.ssh.sshfilepanel.new_folder.c75ba807
source: New Folder
zh_hans: 新建文件夹

# ui.swift.ssh.sshfilepanel.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.ssh.sshfilepanel.open.ed077f3d
source: Open
zh_hans: 打开

# ui.swift.ssh.sshfilepanel.refresh.0e916101
source: Refresh
zh_hans: 刷新

# ui.swift.ssh.sshfilepanel.replace.95e15439
source: Replace
zh_hans: 替换

source: Replacing it will overwrite its current contents.
zh_hans: 替换后将覆盖其当前内容。

# ui.swift.ssh.sshfilepanel.save.1509f561
source: Save
zh_hans: 存储

# ui.swift.ssh.sshfilepanel.save_as.147fcffb
source: Save As:
zh_hans: 存储为：

# ui.swift.ssh.sshfilepanel.search.49c266ba
source: Search
zh_hans: 搜索

# ui.swift.ssh.sshfilepanel.show_hidden_files.415951a5
source: Show Hidden Files
zh_hans: 显示隐藏文件

# ui.swift.ssh.sshfilepanel.the_connection_to_0_was_lost.3427538c
source: The connection to %1$@ was lost.
zh_hans: 与%1$@的连接已断开。

# ui.swift.ssh.sshfilepanel.unable_to_create_folder.31b867f7
source: Unable to create folder
zh_hans: 无法创建文件夹

# ui.swift.ssh.sshfilepanel.use_system_panel.0ed61248
source: Use System Panel…
zh_hans: 使用系统面板…

# ui.swift.ssh.sshfilepanelfilelist.0_image.bd83b343
source: %1$@ image
zh_hans: %1$@ 图像

# ui.swift.ssh.sshfilepanelfilelist.alias.b19e02e9
source: Alias
zh_hans: 替身

# ui.swift.ssh.sshfilepanelfilelist.archive.66f4804e
source: Archive
zh_hans: 归档

# ui.swift.ssh.sshfilepanelfilelist.audio.bc1b8890
source: Audio
zh_hans: 音频

# ui.swift.ssh.sshfilepanelfilelist.date_created.ffb2623a
source: Date Created
zh_hans: 创建日期

# ui.swift.ssh.sshfilepanelfilelist.document.d6bd8c0a
source: Document
zh_hans: 文稿

# ui.swift.ssh.sshfilepanelfilelist.folder.74ccd433
source: Folder
zh_hans: 文件夹

# ui.swift.ssh.sshfilepanelfilelist.host.4a823118
source: Host
zh_hans: 主机

# ui.swift.ssh.sshfilepanelfilelist.kind.f5387f9b
source: Kind
zh_hans: 种类

# ui.swift.ssh.sshfilepanelfilelist.lua_script.781a8661
source: Lua script
zh_hans: Lua 脚本

# ui.swift.ssh.sshfilepanelfilelist.missing_file_information.abc94f1a
source: Missing file information
zh_hans: 缺少文件信息

# ui.swift.ssh.sshfilepanelfilelist.name.dcd1d522
source: Name
zh_hans: 名称

# ui.swift.ssh.sshfilepanelfilelist.neovim_config.efb9ff07
source: Neovim config
zh_hans: Neovim 配置

# ui.swift.ssh.sshfilepanelfilelist.objective_c_source.e272c610
source: Objective-C source
zh_hans: Objective-C 源文件

# ui.swift.ssh.sshfilepanelfilelist.pdf_document.64d53e28
source: PDF document
zh_hans: PDF 文稿

# ui.swift.ssh.sshfilepanelfilelist.shell_script.82fbe842
source: Shell script
zh_hans: Shell 脚本

# ui.swift.ssh.sshfilepanelfilelist.size.1af85190
source: Size
zh_hans: 大小

# ui.swift.ssh.sshfilepanelfilelist.text_document.11e19469
source: Text document
zh_hans: 文本文稿

# ui.swift.ssh.sshfilepanelfilelist.video.d534be82
source: Video
zh_hans: 视频

# ui.swift.ssh.sshfilepanelfilelist.zero_bytes.e113391a
source: Zero bytes
zh_hans: 零字节

# ui.swift.ssh.sshfilepanelsidebar.connected_hosts.9d8a45d0
source: Connected Hosts
zh_hans: 已连接的主机

# ui.swift.ssh.sshfilepanelsidebar.favorites.7a1f2a83
source: Favorites
zh_hans: 个人收藏

# ui.swift.ssh.sshfilepanelsidebar.folder.74ccd433
source: Folder
zh_hans: 文件夹

# ui.swift.ssh.sshfilepanelsidebar.server.aef7de28
source: Server
zh_hans: 服务器

# ui.swift.ssh.sshfilepanelsidebaritem.connected_host.2197053b
source: Connected host
zh_hans: 已连接的主机

# ui.swift.ssh.sshfilepanelsidebaritem.disconnected_host.5d78b172
source: Disconnected host
zh_hans: 未连接的主机

# ui.swift.ssh.sshfilepanelsidebaritem.star.e357d396
source: Star
zh_hans: 星标

# ui.swift.ssh.sshfolderdialog.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.ssh.sshfolderdialog.enter_path_e_g_usr_local_bin.25f1cdb1
source: Enter path (e.g., /usr/local/bin)
zh_hans: 输入路径（例如 /usr/local/bin）

# ui.swift.ssh.sshfolderdialog.folder_on_0.1471dd0d
source: Folder on %1$@
zh_hans: %1$@ 上的文件夹

# ui.swift.ssh.sshfolderdialog.go.6cc8519b
source: Go
zh_hans: 前往

# ui.swift.ssh.sshfolderdialog.go_to_the_folder.62bb0763
source: Go to the folder:
zh_hans: 前往文件夹：

# ui.swift.ssh.sshfolderdialog.loading_completions.3b0bbedb
source: Loading completions…
zh_hans: 正在加载补全…

# ui.swift.ssh.sshfolderdialog.type_a_pathname_or_select_from_the_pop.a6cf9661
source: Type a pathname or select from the pop-up menu
zh_hans: 输入路径，或从弹出式菜单中选择

source: Add Trigger…
zh_hans: 添加触发器…

source: Edit Triggers…
zh_hans: 编辑触发器…

# ui.swift.statusbar.components.itermstatusbartriggerscomponent.triggers.e5ace1dc
source: Triggers…
zh_hans: 触发器…

source: Triggers Menu
zh_hans: 触发器菜单

source: When clicked, opens a menu of triggers. You can use it to enable or disable triggers.
zh_hans: 点按后会打开触发器菜单，可在其中启用或停用触发器。

# ui.swift.statusbar.components.minifilterviewcontroller.filter.638e249f
source: Filter
zh_hans: 过滤

# ui.swift.statusbar.components.statusbarfiltercomponent.color.6b73191a
source: Color
zh_hans: 颜色

# ui.swift.statusbar.components.statusbarfiltercomponent.filter.d226c8d9
source: ⥹ Filter
zh_hans: ⥹ 筛选

# ui.swift.statusbar.components.statusbarfiltercomponent.filter_tool.63cd478b
source: Filter Tool
zh_hans: 筛选工具

source: Filter tool to remove non-matching lines from terminal window.
zh_hans: 用于从终端窗口中移除不匹配行的筛选工具。

# ui.swift.statuswindowsviews.itermpleasewaitwindow.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.terminalview.commandinfoviewcontroller.add_command_as_snippet.1d7e8a18
source: Add Command as Snippet
zh_hans: 将命令添加为片段

source: Copy Command URL to Clipboard
zh_hans: 将命令 URL 拷贝到剪贴板

# ui.swift.terminalview.commandinfoviewcontroller.open_share_sheet.9f9fb3b0
source: Open Share Sheet…
zh_hans: 打开共享表单…

# ui.swift.terminalview.commandinfoviewcontroller.snippet_added.0a54b0a6
source: Snippet Added
zh_hans: 已添加片段

# ui.terminal.command_info.started_at
source: Started at %1$@
zh_hans: 开始于 %1$@

# ui.swift.terminalview.commandinfoviewcontroller.still_running.96cbd115
source: Still Running
zh_hans: 仍在运行

# ui.swift.terminalview.commandinfoviewcontroller.unknown.b764cdc0
source: Unknown
zh_hans: 未知

# ui.swift.terminalview.itermuploadindicator.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.terminalview.itermuploadindicator.uploading_0.b973176f
source: Uploading “%1$@”…
zh_hans: 正在上传“%1$@”…

# ui.swift.terminalview.pseudoterminal.default_picker.779c5e14
source: Default Picker
zh_hans: 默认选择器

# ui.swift.terminalview.pseudoterminal.recent_tab_colors.72b0b3bf
source: Recent Tab Colors
zh_hans: 最近使用的标签页颜色

# ui.swift.terminalview.selectsessionbutton.select_this_session.4385e575
source: Select this Session
zh_hans: 选择此会话

# ui.swift.terminalview.selectsessionbutton.title.7e8cd205
source: Title
zh_hans: 标题

# ui.swift.terminalview.terminalbutton.command_settings.529786b4
source: Command Settings…
zh_hans: 命令设置…

# ui.swift.terminalview.terminalbutton.copy_command_to_clipboard.334c24c1
source: Copy command to clipboard
zh_hans: 将命令拷贝到剪贴板

# ui.swift.terminalview.terminalbutton.fold_block.0908eff3
source: Fold block
zh_hans: 折叠块

# ui.swift.terminalview.terminalbutton.fold_command.af663c4c
source: Fold command
zh_hans: 折叠命令

# ui.swift.terminalview.terminalbutton.open_command_info.732e6e54
source: Open Command Info…
zh_hans: 打开命令信息…

# ui.swift.terminalview.terminalbutton.reveal_embedded_command.9595f2da
source: Reveal embedded command
zh_hans: 显示嵌入命令

# ui.swift.terminalview.terminalbutton.share_command.cb90afe1
source: Share command…
zh_hans: 共享命令…

# ui.swift.terminalview.terminalbutton.toggle_named_mark.92a55bcf
source: Toggle named mark
zh_hans: 切换命名标记

# ui.swift.terminalview.terminalbutton.unfold_block.9376de0d
source: Unfold block
zh_hans: 展开块

# ui.swift.terminalview.terminalbutton.unfold_command.83f2162b
source: Unfold command
zh_hans: 展开命令

# ui.swift.toolbelt.statusprioritysettings.add.9fd728c6
source: Add
zh_hans: 添加

# ui.swift.toolbelt.statusprioritysettings.cancel.19766ed6
source: Cancel
zh_hans: 取消

source: Enter a substring to match against status text (case-insensitive).
zh_hans: 输入要与状态文本匹配的子字符串（不区分大小写）。

# ui.swift.toolbelt.statusprioritysettings.merge_workgroup_statuses.1041c4ab
source: Merge workgroup statuses
zh_hans: 合并工作组状态

# ui.swift.toolbelt.statusprioritysettings.new_priority_pattern.f8964690
source: New Priority Pattern
zh_hans: 新建优先级模式

# ui.swift.toolbelt.statusprioritysettings.notify.f4e2b773
source: Notify
zh_hans: 通知

# ui.swift.toolbelt.statusprioritysettings.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.toolbelt.statusprioritysettings.pattern.4288ade7
source: Pattern
zh_hans: 模式

# ui.swift.toolbelt.statusprioritysettings.remove.c3812fc4
source: Remove
zh_hans: 移除

# ui.swift.toolbelt.statusprioritysettings.show_status_in_tab_subtitle.cdf26017
source: Show status in tab subtitle
zh_hans: 在标签页副标题中显示状态

source: Statuses are sorted by priority. Items near the top have higher priority. Drag to reorder. Click to edit.
zh_hans: 状态按优先级排序。越靠上优先级越高。拖动可重新排序，点按可编辑。

source: When enabled, only the most recent status from each workgroup is shown.
zh_hans: 启用后，每个工作组仅显示最新状态。

# ui.swift.toolbelt.toolcodecierge.assistant_0.1f55e279
source: ### 🔮 Assistant %1$@
zh_hans: ### 🔮 助理 %1$@

# ui.swift.toolbelt.toolcodecierge.assistant_0.ed862ca9
source: ### 🔮 Assistant %1$@
zh_hans: ### 🔮 助理 %1$@

# ui.swift.toolbelt.toolcodecierge.assistant_thinking.33e93964
source: ### 🔮 Assistant Thinking…
zh_hans: ### 🔮 助理 正在思考…

# ui.swift.toolbelt.toolcodecierge.cancel.19766ed6
source: Cancel
zh_hans: 取消

# ui.swift.toolbelt.toolcodecierge.codecierge_usage_warning.21244625
source: Codecierge Usage Warning
zh_hans: Codecierge 使用警告

# ui.swift.toolbelt.toolcodecierge.codecierge_uses_ai_to_help_you_in_your.a7586cbb
source: Codecierge uses AI to help you in your terminal.
zh_hans: Codecierge 使用 AI 在终端中帮助您。

# ui.swift.toolbelt.toolcodecierge.danger.849ca3bd
source: Danger!
zh_hans: 危险！

# ui.swift.toolbelt.toolcodecierge.end_task.a869a8fc
source: End Task
zh_hans: 结束任务

source: Everything that happens in your terminal while Codecierge is running will be sent to your AI provider. Don't send them confidential information!
zh_hans: Codecierge 运行期间，终端中发生的一切都会发送给您的 AI 提供商。请勿向其发送机密信息！

source: Generative AI has been disabled by the system administrator.
zh_hans: 系统管理员已停用生成式 AI。

# ui.swift.toolbelt.toolcodecierge.get_started.983f3110
source: Get Started
zh_hans: 开始使用

# ui.toolbelt.codecierge.goal
source: Goal: %1$@
zh_hans: 目标：%1$@

# ui.swift.toolbelt.toolcodecierge.i_want_to.6710be9e
source: I want to…
zh_hans: 我想要…

# ui.swift.toolbelt.toolcodecierge.keep_going.c41a2a7a
source: Keep Going
zh_hans: 继续

# ui.swift.toolbelt.toolcodecierge.ok.565339bc
source: OK
zh_hans: 好

# ui.swift.toolbelt.toolcodecierge.privacy_warning.4555da28
source: Privacy Warning
zh_hans: 隐私警告

# ui.swift.toolbelt.toolcodecierge.response.9061383b
source: Response
zh_hans: 回复

# ui.swift.toolbelt.toolcodecierge.reveal_setting.bceec044
source: Reveal Setting
zh_hans: 显示相关设置

# ui.swift.toolbelt.toolcodecierge.run_commands_automatically.a63228be
source: Run commands automatically
zh_hans: 自动运行命令

# ui.swift.toolbelt.toolcodecierge.running_0.287ecc11
source: Running `%1$@`
zh_hans: 正在运行 `%1$@`

# ui.swift.toolbelt.toolcodecierge.send_reply.625aafc3
source: Send reply
zh_hans: 发送回复

# ui.swift.toolbelt.toolcodecierge.start.e4bb9f1e
source: Start
zh_hans: 开始

# ui.swift.toolbelt.toolcodecierge.stop_codecierge.8779a340
source: Stop Codecierge
zh_hans: 停止 Codecierge

# ui.swift.toolbelt.toolcodecierge.terminal_0.172caf02
source: ### 💻 Terminal `%1$@`
zh_hans: ### 💻 终端 `%1$@`

# ui.swift.toolbelt.toolcodecierge.there_was_an_error_0.144e1067
source: There was an error: %1$@
zh_hans: 发生错误：%1$@

# ui.swift.toolbelt.toolcodecierge.thinking.a02f1cea
source: Thinking…
zh_hans: 正在思考…

source: This lets an AI completely control your computer. It could delete your files, do something stupid or dangerous, or lead to the downfall of humanity. Proceed with caution.
zh_hans: 这会让 AI 完全控制您的电脑。它可能删除文件、做出愚蠢或危险的操作，甚至导致人类灭亡。请谨慎继续。

# ui.swift.toolbelt.toolcodecierge.what_are_you_trying_to_do_i_ll.63ba8efe
source: What are you trying to do? I'll suggest commands and explain their output.
zh_hans: 您想完成什么？我会建议命令并解释其输出。

# ui.swift.toolbelt.toolcodecierge.writing_to_0.64659b44
source: Writing to %1$@
zh_hans: 正在写入 %1$@

# ui.swift.toolbelt.toolcodecierge.you_0.a6076d19
source: ### 👤 You %1$@
zh_hans: ### 👤 您 %1$@

source: You must enable AI features to use Codecierge.
zh_hans: 必须启用 AI 功能才能使用 Codecierge。

source: Your codecierge session has been going on for a long time. Are you still using it? If not, stop it to save money and privacy.
zh_hans: Codecierge 会话已运行很长时间。您仍在使用它吗？如果没有，请停止会话，以节省费用并保护隐私。

# ui.swift.toolbelt.toolnamedmarks.add.9fd728c6
source: Add
zh_hans: 添加

# ui.swift.toolbelt.toolnamedmarks.edit.464c4ffd
source: Edit
zh_hans: 编辑

# ui.swift.toolbelt.toolnamedmarks.remove.c3812fc4
source: Remove
zh_hans: 移除

# ui.swift.toolbelt.toolnamedmarks.unnamed.13662c69
source: (Unnamed)
zh_hans: （未命名）

# ui.swift.toolbelt.toolstatus.notify_on_status_change.526146c2
source: Notify on status change
zh_hans: 状态变化时通知

# ui.swift.toolbelt.toolstatus.notify_with_an_alert_when_any_session_in.5ebf2758
source: Notify with an alert when any session in this window changes status.
zh_hans: 此窗口中任一会话的状态变化时显示提醒。

source: Notify with an alert when the selected session’s status changes.
zh_hans: 所选会话的状态变化时显示提醒。

# ui.swift.toolbelt.toolstatus.pane_0.8927b1a3
source: Pane %1$lld
zh_hans: 窗格 %1$lld

# ui.swift.toolbelt.toolstatus.select_a_session_to_snooze_it.aecc4af6
source: Select a session to snooze it.
zh_hans: 选择要暂缓显示的会话。

source: ## Session Status The **Session Status** tool shows the status of sessions across all tabs. Each entry displays the session name, a colored indicator dot, status text, and a keyboard shortcut to jump to that session. ### Setting Status **Triggers:** Add a **Set Tab Status** trigger in **Prefs > Profiles > Advanced > Triggers**. It lets you set the status text, dot color, and text color when a regex matches terminal output. **Control Sequence (OSC 21337):** Programs can set tab status directly: `printf '\e]21337;status=Working;indicator=#ffa500\a'` Supported keys (separated by `;`): * `status=TEXT` — Sets the status text (e.g., “Working”, “Waiting”). * `indicator=COLOR` — Sets the dot color. * `status-color=COLOR` — Sets the status text color. * `detail=TEXT` — Sets optional detail text shown below the status (wraps up to 3 lines). Colors use xterm format: `rgb:RR/GG/BB` (hex, 1–4 digits per component) or `#RRGGBB`. Set a key to empty to clear it: `status=` clears the status text. **Clear all status:** `printf '\e]21337;status=;indicator=\a'` ### Priority Sorting Sessions are sorted by priority. Click the ⚙ button to configure which status keywords have the highest priority. The default order is: waiting, working, idle. ### Snoozing Right-click a row and choose **Snooze** to move it to the bottom of the list and dim it. A snoozed entry automatically un-snoozes the next time its status changes.
zh_hans: ## 会话状态 **会话状态**工具会显示所有标签页中会话的状态。每个条目都会显示会话名称、彩色指示点、状态文本，以及跳转到该会话的键盘快捷键。 ### 设置状态 **触发器：**在**设置 > 配置文件 > 高级 > 触发器**中添加**设置标签页状态**触发器。当正则表达式与终端输出匹配时，您可以用它设置状态文本、指示点颜色和文本颜色。 **控制序列（OSC 21337）：**程序可以直接设置标签页状态： `printf '\e]21337;status=Working;indicator=#ffa500\a'` 支持以下键（使用 `;` 分隔）： * `status=TEXT` — 设置状态文本（例如“Working”“Waiting”）。 * `indicator=COLOR` — 设置指示点颜色。 * `status-color=COLOR` — 设置状态文本颜色。 * `detail=TEXT` — 设置在状态下方显示的可选详细文本（最多换行 3 行）。 颜色使用 xterm 格式：`rgb:RR/GG/BB`（每个分量为 1–4 位十六进制数）或 `#RRGGBB`。 将键值留空可将其清除：`status=` 会清除状态文本。 **清除所有状态：**`printf '\e]21337;status=;indicator=\a'` ### 优先级排序 会话按优先级排序。点按 ⚙ 按钮可配置哪些状态关键词具有最高优先级。默认顺序为：waiting、working、idle。 ### 暂缓 右键点按一行并选择**暂缓**，可将它移到列表底部并变暗。暂缓的条目会在下次状态变化时自动恢复。

# ui.swift.toolbelt.toolstatus.settings.74a883a0
source: Settings
zh_hans: 设置

# ui.swift.toolbelt.toolstatus.snooze.52102940
source: Snooze
zh_hans: 暂缓

# ui.swift.toolbelt.toolstatus.snooze_the_selected_session_so_it_sinks_to.316f29f2
source: Snooze the selected session so it sinks to the bottom of the list and dims until its status changes.
zh_hans: 暂缓所选会话，使其沉到列表底部并变暗，直至状态发生变化。

# ui.swift.toolbelt.toolstatus.tab_0.675919b9
source: Tab %1$lld
zh_hans: 标签页 %1$lld

# ui.swift.toolbelt.toolstatus.un_snooze_the_selected_session.59a39875
source: Un-snooze the selected session.
zh_hans: 取消暂缓所选会话。

source: Watching the selected session for a status change. An alert will appear on the next change, then turn this off.
zh_hans: 正在监视所选会话的状态变化。下次变化时会显示提醒，然后关闭此选项。

source: Watching this window for a session status change. An alert will appear on the next change, then turn this off.
zh_hans: 正在监视此窗口中的会话状态变化。下次变化时会显示提醒，然后关闭此选项。

# ui.swift.toolbelt.toolstatuscellview.notify_on_status_change_armed.7256c785
source: Notify on status change armed
zh_hans: 已启用状态变化通知

# ui.swift.toolbelt.toolstatuscellview.snoozed.88096584
source: Snoozed
zh_hans: 已暂缓

# ui.swift.triggers.bufferinputtrigger.buffer_input.ecb7661d
source: Buffer Input…
zh_hans: 缓冲输入…

# ui.swift.triggers.bufferinputtrigger.start_buffering.f8706b96
source: Start buffering
zh_hans: 开始缓冲

# ui.swift.triggers.bufferinputtrigger.start_buffering_input.9e4cac20
source: Start Buffering Input
zh_hans: 开始缓冲输入

# ui.swift.triggers.bufferinputtrigger.stop_buffering.6d97a5ce
source: Stop buffering
zh_hans: 停止缓冲

# ui.swift.triggers.bufferinputtrigger.stop_buffering_input.b1c5cfdb
source: Stop Buffering Input
zh_hans: 停止缓冲输入

# ui.swift.triggers.enterworkgroupbrowsertrigger.enter_workgroup.c0c5d9bc
source: Enter Workgroup…
zh_hans: 进入工作组…

# ui.swift.triggers.enterworkgroupbrowsertrigger.enter_workgroup_0.30052a49
source: Enter Workgroup “%1$@”
zh_hans: 进入工作组“%1$@”

# ui.swift.triggers.enterworkgroupbrowsertrigger.missing.12954e60
source: (missing)
zh_hans: （缺失）

# ui.swift.triggers.enterworkgroupbrowsertrigger.unset.4d993827
source: (unset)
zh_hans: （未设置）

# ui.swift.triggers.enterworkgroupbrowsertrigger.untitled.f59ab8d1
source: Untitled
zh_hans: 未命名

# ui.swift.triggers.enterworkgrouptrigger.enter_workgroup.c0c5d9bc
source: Enter Workgroup…
zh_hans: 进入工作组…

# ui.swift.triggers.exitworkgroupbrowsertrigger.exit_workgroup.ad1c7dcb
source: Exit Workgroup
zh_hans: 退出工作组

# ui.swift.triggers.exitworkgrouptrigger.exit_workgroup.ad1c7dcb
source: Exit Workgroup
zh_hans: 退出工作组

# ui.swift.triggers.foldtrigger.fold_to_named_mark.9e6ddad5
source: Fold to Named Mark
zh_hans: 折叠到命名标记

# ui.swift.triggers.foldtrigger.name_of_mark.2570d97f
source: Name of Mark
zh_hans: 标记名称

# ui.swift.triggers.highlightbrowsertrigger.background.effa332c
source: Background:
zh_hans: 背景：

# ui.swift.triggers.highlightbrowsertrigger.highlight_text.ca15b46a
source: Highlight Text
zh_hans: 高亮文本

# ui.swift.triggers.highlightbrowsertrigger.text.21784f40
source: Text:
zh_hans: 文本：

# ui.swift.triggers.hyperlinkbrowsertrigger.make_hyperlink.0df9e2a5
source: Make Hyperlink…
zh_hans: 创建超链接…

# ui.swift.triggers.hyperlinkbrowsertrigger.make_hyperlink_with_url_0.30e7c32f
source: Make Hyperlink with URL “%1$@”
zh_hans: 创建 URL 为“%1$@”的超链接

source: Inject Javascript (Content Regex)
zh_hans: 注入 JavaScript（内容正则表达式）

# ui.swift.triggers.injectjavascripttrigger.inject_javascript_url_regex.ad9221c7
source: Inject Javascript (URL Regex)
zh_hans: 注入 JavaScript（URL 正则表达式）

# ui.swift.triggers.injecttrigger.inject_data.d0cb440a
source: Inject Data…
zh_hans: 注入数据…

# ui.swift.triggers.injecttrigger.use_e_for_esc_a_for_g.ce3aeb9f
source: Use \e for esc, \a for ^G.
zh_hans: 使用 \e 表示 Esc，使用 \a 表示 ^G。

# ui.swift.triggers.itermeventtriggerparameterview.activity_after_idle.285e5198
source: Activity After Idle
zh_hans: 空闲后恢复活动

# ui.swift.triggers.itermeventtriggerparameterview.any.2b505597
source: Any
zh_hans: 任意

# ui.swift.triggers.itermeventtriggerparameterview.appears.6fdf019c
source: Appears
zh_hans: 出现

# ui.swift.triggers.itermeventtriggerparameterview.appears_or_disappears.a2b9cf44
source: Appears or Disappears
zh_hans: 出现或消失

# ui.swift.triggers.itermeventtriggerparameterview.bell_received.bb3440c2
source: Bell Received
zh_hans: 收到终端响铃

# ui.swift.triggers.itermeventtriggerparameterview.command.a7a9c915
source: Command:
zh_hans: 命令：

# ui.swift.triggers.itermeventtriggerparameterview.command_finished.ec70c38b
source: Command Finished
zh_hans: 命令已完成

# ui.swift.triggers.itermeventtriggerparameterview.custom_escape_sequence.07884d74
source: Custom Escape Sequence
zh_hans: 自定义转义序列

# ui.swift.triggers.itermeventtriggerparameterview.directory.8b948460
source: Directory:
zh_hans: 目录：

# ui.swift.triggers.itermeventtriggerparameterview.directory_changed.dde8d641
source: Directory Changed
zh_hans: 目录已更改

# ui.swift.triggers.itermeventtriggerparameterview.disappears.72d4b91c
source: Disappears
zh_hans: 消失

# ui.swift.triggers.itermeventtriggerparameterview.exit_code.115a0020
source: Exit Code:
zh_hans: 退出码：

# ui.swift.triggers.itermeventtriggerparameterview.exit_code.ccc6eb1c
source: Exit code
zh_hans: 退出代码

# ui.swift.triggers.itermeventtriggerparameterview.fire_when.27d787ae
source: Fire When:
zh_hans: 触发条件：

source: Fires when a command exits. Requires shell integration.
zh_hans: 当命令退出时触发。需要 Shell 集成。

source: Fires when a command runs longer than the threshold.
zh_hans: 命令运行时间超过阈值时触发。

source: Fires when a notification is posted by a control sequence (OSC 9).
zh_hans: 控制序列（OSC 9）发布通知时触发。

source: Fires when a process matching the job filter enters the foreground-job ancestry chain.
zh_hans: 与作业过滤条件匹配的进程进入前台作业祖先链时触发。

source: Fires when a process matching the job filter leaves the foreground-job ancestry chain.
zh_hans: 与作业过滤条件匹配的进程离开前台作业祖先链时触发。

source: Fires when a progress bar appears or disappears.
zh_hans: 进度条出现或消失时触发。

source: Fires when a session variable changes to a value matching the regex.
zh_hans: 会话变量变为与正则表达式匹配的值时触发。

source: Fires when a specific OSC escape sequence is received.
zh_hans: 收到指定的 OSC 转义序列时触发。

source: Fires when a terminal bell (\a) is received.
zh_hans: 收到终端响铃（\a）时触发。

source: Fires when connecting to a different host via SSH.
zh_hans: 通过 SSH 连接到其他主机时触发。

source: Fires when no output is received for the specified duration.
zh_hans: 在指定时长内未收到输出时触发。

source: Fires when output resumes after being idle.
zh_hans: 空闲后恢复输出时触发。

source: Fires when shell integration detects a new prompt.
zh_hans: 当 Shell 集成检测到新的提示符时触发。

source: Fires when the current user changes (su/sudo).
zh_hans: 当前用户发生变化（su/sudo）时触发。

source: Fires when the session terminates.
zh_hans: 会话终止时触发。

source: Fires when the working directory changes.
zh_hans: 当工作目录发生变化时触发。

# ui.swift.triggers.itermeventtriggerparameterview.host.95695f07
source: Host:
zh_hans: 主机：

# ui.swift.triggers.itermeventtriggerparameterview.host_changed.904360b2
source: Host Changed
zh_hans: 主机已更改

# ui.swift.triggers.itermeventtriggerparameterview.idle_silence.50ca45f7
source: Idle (Silence)
zh_hans: 空闲（无输出）

# ui.swift.triggers.itermeventtriggerparameterview.job.34b0e24b
source: Job:
zh_hans: 作业：

# ui.swift.triggers.itermeventtriggerparameterview.job_ended.0fb54d33
source: Job Ended
zh_hans: 作业已结束

# ui.swift.triggers.itermeventtriggerparameterview.job_started.8d5b30de
source: Job Started
zh_hans: 作业已启动

# ui.swift.triggers.itermeventtriggerparameterview.long_running_command.b943caf4
source: Long-Running Command
zh_hans: 长时间运行的命令

# ui.swift.triggers.itermeventtriggerparameterview.message.f5394f72
source: Message:
zh_hans: 消息：

source: Name of the session variable to watch
zh_hans: 要监视的会话变量名称
